<?php declare(strict_types=1);

namespace DoctrineMigrations;

use Doctrine\DBAL\Schema\Schema;
use Doctrine\Migrations\AbstractMigration;

final class Version20181016113609 extends AbstractMigration
{
    public function up(Schema $schema) : void
    {$sql = <<<SQL
INSERT INTO ig_action (value)
VALUES
('Сделать'),('Придумать'),('Написать'),('Создать'),('Переписать'),('Нарисовать'),('Собрать'),('Разобрать'),
('Сконструировать'),('Описать'),('Разработать'),('Сочинить'),('Купить'),('Продать'),('Скопировать'),
('Упростить'),('Оптимизировать'),('Начертить'),('Отредактировать'),('Изменить'),('Продать'),('Исследовать'),
('Понять'),('Утилизировать')
SQL;

        $this->addSql($sql);

        $sql = <<<SQL
INSERT INTO ig_adjective (value)
VALUES
('умного'),('запутанный'),('быстрый'),('временную'),('креативную'),('функциональную'),('надежную'),('простую'),
('лечебный'),('эффективный'),('творческую'),('красивую'),('разностороннюю'),('сложную'),('долговечный'),
('оптимизированный'),('массовый'),('бесперебойный'),('обычный'),('бесконечную'),('домашний'),('ненужный'),
('дешевую'),('дорогую')
SQL;

        $this->addSql($sql);

        $sql = <<<SQL
INSERT INTO ig_noun (value)
VALUES
('робота'),('сценарий'),('алгоритм'),('машину'),('почта'),('дорога'),('процессор'),('провод'),
('монитор'),('телевизор'),('Wi-Fi'),('Планшет'),('Смартфон'),('микроконтроллер'),('наушники'),
('поезд'),('микроволновку'),('костюм'),('двигатель'),('лампа'),('воздух'),('вселенную'),
('животное'),('руда')
SQL;

        $this->addSql($sql);
    }

    public function down(Schema $schema) : void
    {
    }
}
